> Not surprisingly, the coronavirus pandemic that caused widespread illness, death, and economic havoc around the world starting in early 2020 affected taxi rides in New York. In this exercise, we look at how we can load data from multiple files into a single data frame and then make some simple comparisons between data before the pan demic and while New York was in the middle of it. 
>
>In this exercise, I want you to create a data frame from two different CSV files con taining New York taxi data: one from July 2019 (before the pandemic) and a second from July 2020 (near the height of the pandemic, at least in New York). The data frame should contain three columns from the files: passenger_count, total_amount, and payment_type. It should also include a fifth column, year, which should be set to 2019 or 2020, depending on the file from which the data was loaded. With that data in hand, I want you to answer a few questions:

In [1]:
import pandas as pd
from pandas import DataFrame

df_jul_2019 = pd.read_csv('./Data/nyc_taxi_2019-06.csv',
                           usecols=['passenger_count', 'total_amount', 'payment_type'])
df_jul_2020 = pd.read_csv('./Data/nyc_taxi_2020-06.csv',
                           usecols=['passenger_count', 'total_amount', 'payment_type'])

In [2]:
df_jul_2019

         passenger_count  payment_type  total_amount
0                      1             2          4.30
1                      1             2          6.30
2                      1             2         18.80
3                      0             2          4.30
4                      1             1         15.95
...                  ...           ...           ...
6941019                1             1         16.80
6941020                1             2          9.80
6941021                1             1          8.75
6941022                1             1         13.56
6941023                2             1         11.80

[6941024 rows x 3 columns]

In [3]:
df_jul_2020

        passenger_count  payment_type  total_amount
0                   1.0           1.0         23.30
1                   1.0           1.0         25.30
2                   1.0           2.0         11.30
3                   1.0           2.0         21.30
4                   1.0           1.0         21.95
...                 ...           ...           ...
549755              NaN           NaN         42.58
549756              NaN           NaN         15.00
549757              NaN           NaN         22.00
549758              NaN           NaN         35.17
549759              NaN           NaN         32.98

[549760 rows x 3 columns]

In [8]:
df_jul_2019['year'] = 2019
df_jul_2020['year'] = 2020

In [9]:
df = pd.concat([df_jul_2019, df_jul_2020], ignore_index=True)

In [10]:
df

         passenger_count  payment_type  total_amount  year
0                    1.0           2.0          4.30  2019
1                    1.0           2.0          6.30  2019
2                    1.0           2.0         18.80  2019
3                    0.0           2.0          4.30  2019
4                    1.0           1.0         15.95  2019
...                  ...           ...           ...   ...
7490779              NaN           NaN         42.58  2020
7490780              NaN           NaN         15.00  2020
7490781              NaN           NaN         22.00  2020
7490782              NaN           NaN         35.17  2020
7490783              NaN           NaN         32.98  2020

[7490784 rows x 4 columns]

In [11]:
df.loc[df.year == 2020, 'passenger_count'].count() - df.loc[df.year == 2019, 'passenger_count'].count()

-6441981

In [22]:
(df.loc[df.year == 2020, 'total_amount'].sum() - df.loc[df.year == 2019, 'total_amount'].sum()).round(2)

-126706236.55

In [23]:
df.loc[(df.year == 2019) & (df.passenger_count > 1), 'passenger_count'].count() / df.loc[(df.year == 2019), 'passenger_count'].count()

0.2821259514446283

In [24]:
df.loc[(df.year == 2020) & (df.passenger_count > 1), 'passenger_count'].count() / df.loc[(df.year == 2020), 'passenger_count'].count()

0.1939832840055867

In [26]:
df.loc[(df['year'] == 2019) & (df['payment_type'] == 2), 'payment_type'].count() / df.loc[df['year'] == 2019, 'payment_type'].count()

0.27421472681840603

In [27]:
df.loc[(df['year'] == 2020) & (df['payment_type'] == 2), 'payment_type'].count() / df.loc[df['year'] == 2020, 'payment_type'].count()

0.3385339539879329